# pandas

In [1]:
import pandas as pd

# pandas的数据结构

In [2]:
obj = pd.Series([4, 7, -5, 3])

obj

0    4
1    7
2   -5
3    3
dtype: int64

In [3]:
obj.values

array([ 4,  7, -5,  3])

In [4]:
obj.index
#like range(4)

RangeIndex(start=0, stop=4, step=1)

In [5]:
obj2 = pd.Series([4, 7, -5, 3], index=['d', 'b', 'a', 'c'] )
obj2

d    4
b    7
a   -5
c    3
dtype: int64

In [6]:
obj2.index

Index(['d', 'b', 'a', 'c'], dtype='object')

In [7]:
obj2['a']

-5

In [8]:
obj2['d'] = 6

obj2[['c', 'a', 'd']]

c    3
a   -5
d    6
dtype: int64

In [9]:
obj2[obj2 > 0]

d    6
b    7
c    3
dtype: int64

In [10]:
obj2 * 2

d    12
b    14
a   -10
c     6
dtype: int64

In [11]:
import numpy as np
np.exp(obj2)

d     403.428793
b    1096.633158
a       0.006738
c      20.085537
dtype: float64

In [12]:
'b' in obj2

True

In [13]:
'e' in obj2

False

In [14]:
sdata = {'Ohio': 35000, 'Oregon': 16000, 'Texas': 71000, 'Utah': 5000}

obj3=pd.Series(sdata)

obj3

Ohio      35000
Oregon    16000
Texas     71000
Utah       5000
dtype: int64

In [15]:
states = ['California', 'Ohio', 'Oregon', 'Texas']

obj4 = pd.Series(sdata, index=states)

obj4

California        NaN
Ohio          35000.0
Oregon        16000.0
Texas         71000.0
dtype: float64

In [16]:
pd.isnull(obj4)

California     True
Ohio          False
Oregon        False
Texas         False
dtype: bool

In [17]:
pd.notnull(obj4)

California    False
Ohio           True
Oregon         True
Texas          True
dtype: bool

In [18]:
obj4.isnull()

California     True
Ohio          False
Oregon        False
Texas         False
dtype: bool

In [19]:
obj3

Ohio      35000
Oregon    16000
Texas     71000
Utah       5000
dtype: int64

In [20]:
obj4

California        NaN
Ohio          35000.0
Oregon        16000.0
Texas         71000.0
dtype: float64

In [21]:
obj3 + obj4

California         NaN
Ohio           70000.0
Oregon         32000.0
Texas         142000.0
Utah               NaN
dtype: float64

In [22]:
obj4.name = 'population'

obj4.index.name = 'state'

obj4

state
California        NaN
Ohio          35000.0
Oregon        16000.0
Texas         71000.0
Name: population, dtype: float64

In [23]:
obj

0    4
1    7
2   -5
3    3
dtype: int64

In [24]:
obj.index = ['Bob', 'Steve', 'Jeff', 'Ryan']

obj

Bob      4
Steve    7
Jeff    -5
Ryan     3
dtype: int64

# DataFrame

In [25]:
data = {'state': ['Ohio', 'Ohio', 'Ohio', 'Nevada', 'Nevada', 'Nevada'],
        'year': [2000, 2001, 2002, 2001, 2002, 2003],
       'pop': [1.5, 1.7, 3.6, 2.4, 2.9, 3.2]}

frame = pd.DataFrame(data)

frame

    state  year  pop
0    Ohio  2000  1.5
1    Ohio  2001  1.7
2    Ohio  2002  3.6
3  Nevada  2001  2.4
4  Nevada  2002  2.9
5  Nevada  2003  3.2

In [26]:
frame.head()

    state  year  pop
0    Ohio  2000  1.5
1    Ohio  2001  1.7
2    Ohio  2002  3.6
3  Nevada  2001  2.4
4  Nevada  2002  2.9

In [27]:
pd.DataFrame(data, columns=['year', 'state', 'pop'])

   year   state  pop
0  2000    Ohio  1.5
1  2001    Ohio  1.7
2  2002    Ohio  3.6
3  2001  Nevada  2.4
4  2002  Nevada  2.9
5  2003  Nevada  3.2

In [28]:
frame2 = pd.DataFrame(data, columns=['year', 'state', 'pop', 'debt'], index=['one', 'two', 'three', 'four', 'five', 'six'])

frame2

       year   state  pop debt
one    2000    Ohio  1.5  NaN
two    2001    Ohio  1.7  NaN
three  2002    Ohio  3.6  NaN
four   2001  Nevada  2.4  NaN
five   2002  Nevada  2.9  NaN
six    2003  Nevada  3.2  NaN

In [29]:
frame2.columns

Index(['year', 'state', 'pop', 'debt'], dtype='object')

In [30]:
frame2['state']

one        Ohio
two        Ohio
three      Ohio
four     Nevada
five     Nevada
six      Nevada
Name: state, dtype: object

In [31]:
frame2.year

one      2000
two      2001
three    2002
four     2001
five     2002
six      2003
Name: year, dtype: int64

In [32]:
frame2.loc['three']

year     2002
state    Ohio
pop       3.6
debt      NaN
Name: three, dtype: object

In [33]:
frame2['debt'] = 16.5

frame2

       year   state  pop  debt
one    2000    Ohio  1.5  16.5
two    2001    Ohio  1.7  16.5
three  2002    Ohio  3.6  16.5
four   2001  Nevada  2.4  16.5
five   2002  Nevada  2.9  16.5
six    2003  Nevada  3.2  16.5

In [34]:
frame2['debt'] = np.arange(6.)

frame2

       year   state  pop  debt
one    2000    Ohio  1.5   0.0
two    2001    Ohio  1.7   1.0
three  2002    Ohio  3.6   2.0
four   2001  Nevada  2.4   3.0
five   2002  Nevada  2.9   4.0
six    2003  Nevada  3.2   5.0

In [35]:
val = pd.Series([-1.2, -1.5, -1.7], index=['two', 'four', 'five'])

frame2['debt'] = val

frame2

       year   state  pop  debt
one    2000    Ohio  1.5   NaN
two    2001    Ohio  1.7  -1.2
three  2002    Ohio  3.6   NaN
four   2001  Nevada  2.4  -1.5
five   2002  Nevada  2.9  -1.7
six    2003  Nevada  3.2   NaN

In [36]:
frame2['eastern'] = frame2.state == 'Ohio'

frame2

##****不能用frame2.eastern创建新列****

       year   state  pop  debt  eastern
one    2000    Ohio  1.5   NaN     True
two    2001    Ohio  1.7  -1.2     True
three  2002    Ohio  3.6   NaN     True
four   2001  Nevada  2.4  -1.5    False
five   2002  Nevada  2.9  -1.7    False
six    2003  Nevada  3.2   NaN    False

In [37]:
del frame2['eastern']

frame2.columns

Index(['year', 'state', 'pop', 'debt'], dtype='object')

In [38]:
pop = {'Neveda': {2001: 2.4, 2002: 2.9},
      'Ohio': {2000: 1.5, 2001: 1.7, 2002: 3.6}}

frame3 = pd.DataFrame(pop)

frame3

      Neveda  Ohio
2000     NaN   1.5
2001     2.4   1.7
2002     2.9   3.6

In [39]:
frame3.T

        2000  2001  2002
Neveda   NaN   2.4   2.9
Ohio     1.5   1.7   3.6

In [40]:
pd.DataFrame(frame3, index=[2001, 2002, 2003])

      Neveda  Ohio
2001     2.4   1.7
2002     2.9   3.6
2003     NaN   NaN

In [41]:
pdata = {'Ohio': frame3['Ohio'][:-1],
        'Neveda': frame3['Neveda'][:2]}

pd.DataFrame(pdata)

      Ohio  Neveda
2000   1.5     NaN
2001   1.7     2.4

In [42]:
frame3.index.name = 'year'

frame3.columns.name = 'state'

frame3

state  Neveda  Ohio
year
2000      NaN   1.5
2001      2.4   1.7
2002      2.9   3.6

In [43]:
frame3.values

array([[nan, 1.5],
       [2.4, 1.7],
       [2.9, 3.6]])

In [44]:
frame2.values

array([[2000, 'Ohio', 1.5, nan],
       [2001, 'Ohio', 1.7, -1.2],
       [2002, 'Ohio', 3.6, nan],
       [2001, 'Nevada', 2.4, -1.5],
       [2002, 'Nevada', 2.9, -1.7],
       [2003, 'Nevada', 3.2, nan]], dtype=object)

In [45]:
obj = pd.Series(range(3), index=['a', 'b', 'c'])

index = obj.index

index

Index(['a', 'b', 'c'], dtype='object')

In [46]:
index[1:]

Index(['b', 'c'], dtype='object')

In [47]:
index[1] = 'd'

#typeerror

TypeError: Index does not support mutable operations

In [ ]:
labels = pd.Index(np.arange(3))

labels

In [ ]:
obj2 = pd.Series([1.5, -2.5, 0], index=labels)
obj2

In [ ]:
obj2.index is labels

In [ ]:
frame3

In [ ]:
frame3.columns

In [ ]:
'Ohio' in frame3.columns

In [ ]:
2003 in frame3.index

In [ ]:
dup_labels = pd.Index(['foo', 'foo', 'bar', 'bar'])

dup_labels

# 5.2基本功能

In [ ]:
obj = pd.Series([4.5, 7.2, -5.3, 3.6], index=['d', 'b', 'a', 'c'])

obj

In [ ]:
obj2 = obj.reindex(['a', 'b', 'c', 'd', 'e'])

obj2

In [ ]:
obj3 =pd.Series(['blue', 'purple', 'yellow'], index=[0, 2, 4])

obj3

In [ ]:
obj3.reindex(range(6), method='ffill')

In [ ]:
frame = pd.DataFrame(np.arange(9).reshape(3, 3),
                     index=['a', 'c', 'd'],
                     columns=['Ohio', 'Texas', 'California'])

frame

In [ ]:
frame2 = frame.reindex(['a', 'b', 'c', 'd'])

frame2

In [ ]:
states = ['Texas', 'Utah', 'California']

frame.reindex(columns= states)

In [ ]:
obj = pd.Series(np.arange(5.), index=['a', 'b', 'c', 'd', 'e'])

obj

In [ ]:
new_obj = obj.drop('c')

new_obj

In [ ]:
obj.drop(['d', 'c'])

In [ ]:
data = pd.DataFrame(np.arange(16).reshape(4,4),
                    index=['Ohio', 'Colorado', 'Utah', 'New York'],
                    columns=['one', 'two', 'three', 'four'])

data

In [ ]:
data.drop(['Colorado', 'Ohio'])

In [ ]:
data.drop('two', axis=1)

In [ ]:
data.drop(['two', 'four'], axis='columns')

In [ ]:
obj.drop('c', inplace=True)

obj

In [ ]:
obj = pd.Series(np.arange(4.), index=['a', 'b', 'c', 'd'])

obj

In [ ]:
obj['b']

In [ ]:
obj[1]

In [ ]:
obj[2:4]

In [ ]:
obj[['b', 'a', 'd']]

In [ ]:
obj[[1, 3]]

In [ ]:
obj[obj < 2]

In [ ]:
obj['b':'c']

In [ ]:
obj['b':'c'] = 5

obj

In [ ]:
data = pd.DataFrame(np.arange(16).reshape(4, 4),
                    index=['Ohio', 'Colorado', 'Utah', 'New York'],
                    columns=['one', 'two', 'three', 'four'])

data

In [ ]:
data['two']

In [ ]:
data[['three', 'one']]

In [ ]:
data[:2]

In [ ]:
data[data['three'] > 5]

In [ ]:
data < 5

In [ ]:
data[data < 5] = 0

data

In [ ]:
data.loc['Colorado', ['two', 'three']]

In [ ]:
data.iloc[2, [3, 0, 1]]

In [ ]:
data.iloc[2]

In [ ]:
data.iloc[[1, 2], [3, 0, 1]]

In [ ]:
data.loc[:'Utah', 'two']

In [ ]:
data.iloc[:, :3][data.three > 5]

In [ ]:
ser = pd.Series(np.arange(3.))
ser

In [ ]:
ser[-1]#wrong

In [ ]:
ser2 = pd.Series(np.arange(3.), index=['a', 'b', 'c'])

ser2

In [ ]:
ser2[-1]

In [ ]:
ser[:1]

In [ ]:
ser.loc[:1]

In [ ]:
ser.iloc[:1]

In [ ]:
s1 = pd.Series([7.3, -2.5, 3.4, 1.5], index=['a', 'c', 'd', 'e'])

s2= pd.Series([-2.1, 3.6, -1.5, 4, 3.1], index=['a', 'c', 'e', 'f', 'g'])

s1

In [ ]:
s2

In [ ]:
s1 + s2

In [ ]:
df1 = pd.DataFrame(np.arange(9.).reshape(3,3),
                   index=['Ohio', 'Texas', 'Colorado'],
                   columns=['b', 'c', 'd'])

df2 = pd.DataFrame(np.arange(12.).reshape(4,3),
                   index=['Utah', 'Ohio', 'Texas', 'Oregon'],
                   columns=['b', 'd', 'e'])

df1

In [ ]:
df2

In [ ]:
df1 + df2

In [ ]:
df1 = pd.DataFrame({'A': [1, 2]})

df2 = pd.DataFrame({'B': [3, 4]})

df1

In [ ]:
df2

In [ ]:
df1 - df2

In [ ]:
df1 = pd.DataFrame(np.arange(12.).reshape(3,4), 
                  columns=list('abcd'))

df2 = pd.DataFrame(np.arange(20.).reshape(4,5), 
                  columns=list('abcde'))

df1

In [ ]:
df2

In [ ]:
df2.loc[1, 'b'] = np.nan

df2

In [ ]:
df1 + df2

In [ ]:
df1.add(df2, fill_value=0)

In [ ]:
1 / df1

In [ ]:
df1.rdiv(1)

In [ ]:
df1.reindex(columns=df2.columns, fill_value=0)

In [ ]:
arr = np.arange(12.).reshape(3,4)

arr

In [ ]:
arr[0]

In [ ]:
arr - arr[0]

In [ ]:
frame = pd.DataFrame(np.arange(12.).reshape(4,3),
                     columns=list('bde'),
                     index=['Utah', 'Ohio', 'Texas', 'Oregon'])

series = frame.iloc[0]

frame

In [ ]:
series

In [ ]:
frame - series

In [ ]:
series2 = pd.Series(range(3),
                    index=list('bef'))

series2

In [ ]:
frame + series2

In [ ]:
series3 = frame['d']

frame

In [ ]:
series3

In [ ]:
frame.sub(series3, axis='index')

In [ ]:
frame = pd.DataFrame(np.random.randn(4,3),
                     index=['Utah', 'Ohio', 'Texas', 'Oregon'],
                     columns=list('bde'))
frame

In [ ]:
np.abs(frame)

In [ ]:
f = lambda x: x.max() - x.min()

frame.apply(f)

In [ ]:
frame.apply(f, axis='columns')

In [ ]:
def f(x):
    return pd.Series([x.min(), x.max()],
                     index=['min', 'max'])


frame.apply(f)

In [ ]:
format = lambda x: '%.2f' % x

frame.applymap(format)

In [ ]:
frame['e'].map(format)

In [ ]:
obj = pd.Series(range(4), index=['d', 'a', 'b', 'c'])

obj.sort_index()

In [ ]:
frame = pd.DataFrame(np.arange(8).reshape(2, 4),
                     index=['three', 'one'],
                     columns=['d', 'a', 'b', 'c'])

frame.sort_index()

In [ ]:
frame.sort_index(axis=1)

In [ ]:
frame.sort_index(axis=1, ascending=False)

In [ ]:
obj = pd.Series([4, 7, -3, 2])

obj.sort_values()

In [ ]:
obj = pd.Series([4, np.nan, 7, np.nan, -3, 2.0])

obj.sort_values()

In [ ]:
frame = pd.DataFrame({'b': [4, 7, -3, 2], 'a': [0, 1, 0, 1]})

frame

In [ ]:
frame.sort_values(by='b')

In [ ]:
frame.sort_values(by=['a', 'b'])

In [ ]:
obj = pd.Series([7, -5, 7, 4, 2, 0, 4])

obj.rank()

In [ ]:
obj.rank(method='first')

In [ ]:
obj.rank(ascending=False, method='max')

In [ ]:
frame = pd.DataFrame({'b': [4.3, 7, -3, 2],
                      'a': [0, 1, 0, 1],
                      'c': [-2, 5, 8, -2.5]})

frame

In [ ]:
frame.rank(axis='columns')

In [ ]:
obj = pd.Series(range(5), index=['a', 'a', 'b', 'b', 'c'])

obj

In [ ]:
obj.index.is_unique

In [ ]:
obj['a']

In [ ]:
obj['c']

In [ ]:
df = pd.DataFrame(np.random.randn(4,3), 
                  index=['a', 'a', 'b', 'b'])

df

In [ ]:
df.loc['b']

# 汇总和计算描述统计

In [ ]:
df = pd.DataFrame([[1.4, np.nan], [7.1, -4.5],
                   [np.nan, np.nan], [0.75, -1.3]],
                  index=['a', 'b', 'c', 'd'],
                  columns=['one', 'two'])

df

In [ ]:
df.sum()

In [ ]:
df.sum(axis=1)

In [ ]:
df.mean(axis='columns', skipna=False)

In [ ]:
df.idxmax()

In [ ]:
df.cumsum()

In [ ]:
df.describe()

In [49]:
obj = pd.Series(['a', 'a', 'b', 'c'] * 4)

obj.describe()

count     16
unique     3
top        a
freq       8
dtype: object

In [59]:
#import pandas_datareader.data as web
price = pd.read_pickle('examples/yahoo_price.pkl')
volume = pd.read_pickle('examples/yahoo_volume.pkl')
price

                  AAPL        GOOG         IBM       MSFT
Date
2010-01-04   27.990226  313.062468  113.304536  25.884104
2010-01-05   28.038618  311.683844  111.935822  25.892466
2010-01-06   27.592626  303.826685  111.208683  25.733566
2010-01-07   27.541619  296.753749  110.823732  25.465944
2010-01-08   27.724725  300.709808  111.935822  25.641571
2010-01-11   27.480148  300.255255  110.763844  25.315406
2010-01-12   27.167562  294.945572  111.644958  25.148142
2010-01-13   27.550775  293.252243  111.405433  25.382312
2010-01-14   27.391211  294.630868  113.184773  25.892466
2010-01-15   26.933449  289.710772  112.731385  25.808835
2010-01-19   28.124939  293.516976  114.750251  26.009552
2010-01-20   27.692027  289.915587  111.422546  25.583028
2010-01-21   27.213337  291.199286  110.353231  25.097963
2010-01-22   25.863592  274.730736  107.359151  24.219826
2010-01-25   26.559391  269.730740  107.889534  24.520902
2010-01-26   26.934757  270.939526  107.573014  24.671439
2010-01-27   27.188489  270.779695  108.069178  24.813614
2010-01-28   26.065007  266.878565  105.862111  24.387091
2010-01-29   25.119401  264.705742  104.698697  23.567497
2010-02-01   25.468608  266.244198  106.649125  23.759851
2010-02-02   25.616400  265.295156  107.384814  23.801666
2010-02-03   26.057159  270.140309  107.496027  23.943840
2010-02-04   25.118093  263.127321  105.220523  23.283148
2010-02-05   25.564084  265.380075  105.665355  23.433686
2010-02-08   25.388826  266.468996  104.728745  23.182789
2010-02-09   25.659561  267.952522  105.871586  23.425323
2010-02-10   25.519617  266.958496  105.527873  23.408596
2010-02-11   25.983917  267.932539  106.318414  23.517319
2010-02-12   26.207567  266.294170  106.550416  23.358417
2010-02-16   26.602551  270.380071  107.607330  23.820544
...                ...         ...         ...        ...
2016-09-12  105.440002  769.020020  158.289993  57.049999
2016-09-13  107.949997  759.690002  155.809998  56.529999
2016-09-14  111.769997  762.489990  154.050003  56.259998
2016-09-15  115.570000  771.760010  155.660004  57.189999
2016-09-16  114.919998  768.880005  153.839996  57.250000
2016-09-19  113.580002  765.700012  154.869995  56.930000
2016-09-20  113.570000  771.409973  154.449997  56.810001
2016-09-21  113.550003  776.219971  155.529999  57.759998
2016-09-22  114.620003  787.210022  156.110001  57.820000
2016-09-23  112.709999  786.900024  154.979996  57.430000
2016-09-26  112.879997  774.210022  153.979996  56.900002
2016-09-27  113.089996  783.010010  156.770004  57.950001
2016-09-28  113.949997  781.559998  158.289993  58.029999
2016-09-29  112.180000  775.010010  158.110001  57.400002
2016-09-30  113.050003  777.289978  158.850006  57.599998
2016-10-03  112.519997  772.559998  157.610001  57.419998
2016-10-04  113.000000  776.429993  156.460007  57.240002
2016-10-05  113.050003  776.469971  157.080002  57.639999
2016-10-06  113.889999  776.859985  156.880005  57.740002
2016-10-07  114.059998  775.080017  155.669998  57.799999
2016-10-10  116.050003  785.940002  157.020004  58.040001
2016-10-11  116.300003  783.070007  154.789993  57.189999
2016-10-12  117.339996  786.140015  154.289993  57.110001
2016-10-13  116.980003  778.190002  153.720001  56.919998
2016-10-14  117.629997  778.530029  154.449997  57.419998
2016-10-17  117.550003  779.960022  154.770004  57.220001
2016-10-18  117.470001  795.260010  150.720001  57.660000
2016-10-19  117.120003  801.500000  151.259995  57.529999
2016-10-20  117.059998  796.969971  151.520004  57.250000
2016-10-21  116.599998  799.369995  149.630005  59.660000

[1714 rows x 4 columns]

In [60]:
volume

                 AAPL      GOOG       IBM       MSFT
Date
2010-01-04  123432400   3927000   6155300   38409100
2010-01-05  150476200   6031900   6841400   49749600
2010-01-06  138040000   7987100   5605300   58182400
2010-01-07  119282800  12876600   5840600   50559700
2010-01-08  111902700   9483900   4197200   51197400
2010-01-11  115557400  14479800   5730400   68754700
2010-01-12  148614900   9742900   8081500   65912100
2010-01-13  151473000  13041800   6455400   51863500
2010-01-14  108223500   8511900   7111800   63228100
2010-01-15  148516900  10909600   8494400   79913200
2010-01-19  182501900   8665700  13916200   46575700
2010-01-20  153038200   6525700  15197500   54849500
2010-01-21  152038600  12662600   9608600   73086700
2010-01-22  220441900  13651700  10088600  102004600
2010-01-25  266424900   8872800   5738500   63373000
2010-01-26  466777500   8743600   7135300   66639900
2010-01-27  430642100   7958400   8719200   63949500
2010-01-28  293375600   6482300   9622200  117513700
2010-01-29  311488100   8311900  11571200  193888500
2010-02-01  187469100   4518400   7242900   85931100
2010-02-02  174585600   8223000   5899900   54413700
2010-02-03  153832000   6020500   4177100   61397900
2010-02-04  189413000   6780600   9126900   77850000
2010-02-05  212576700   6335600   8617000   80960100
2010-02-08  119567700   5408700   5718500   52820600
2010-02-09  158221700   5660200   6044500   59195800
2010-02-10   92590400   5369000   5219100   48591300
2010-02-11  137586400   4838000   5089000   65993700
2010-02-12  163867200   4576400   8017700   81117200
2010-02-16  135934400   7336100   6777300   51935600
...               ...       ...       ...        ...
2016-09-12   45292800   1286800   4367500   29303000
2016-09-13   62176200   1379900   3636700   30130200
2016-09-14  110888700   1087400   3860600   24062500
2016-09-15   89983600   1305100   3645600   26847000
2016-09-16   79886900   2046000   6463600   44607000
2016-09-19   47023000   1171100   2450100   20937100
2016-09-20   34514300    975300   2159100   17384000
2016-09-21   36003200   1151400   2473900   33707300
2016-09-22   31074000   1463600   2691100   19822200
2016-09-23   52481200   1409500   2702200   19955300
2016-09-26   29869400   1508500   2533300   21688700
2016-09-27   24607400   1138800   2987200   28065100
2016-09-28   29641100   1107900   3310000   20536400
2016-09-29   35887000   1301400   3374800   25463500
2016-09-30   36379100   1580300   3596900   29910800
2016-10-03   21701800   1275900   2227800   19189500
2016-10-04   29736800   1197400   2884100   20085900
2016-10-05   21453100   1457100   1684500   16726400
2016-10-06   28779300   1066300   1950100   16212600
2016-10-07   24358400    930700   2671900   20089000
2016-10-10   36236000   1161400   2481300   18196500
2016-10-11   64041000   1368000   2901300   26497400
2016-10-12   37586800    934900   2964000   22177500
2016-10-13   35192400   1300400   2909900   25313700
2016-10-14   35652200    851100   4358200   27402500
2016-10-17   23624900   1089500   5890400   23830000
2016-10-18   24553500   1995600  12770600   19149500
2016-10-19   20034600    116600   4632900   22878400
2016-10-20   24125800   1734200   4023100   49455600
2016-10-21   22384800   1260500   4401900   79974200

[1714 rows x 4 columns]

In [57]:
returns = price.pct_change()
returns

                AAPL      GOOG       IBM      MSFT
Date
2010-01-04       NaN       NaN       NaN       NaN
2010-01-05  0.001729 -0.004404 -0.012080  0.000323
2010-01-06 -0.015906 -0.025209 -0.006496 -0.006137
2010-01-07 -0.001849 -0.023280 -0.003462 -0.010400
2010-01-08  0.006648  0.013331  0.010035  0.006897
2010-01-11 -0.008822 -0.001512 -0.010470 -0.012720
2010-01-12 -0.011375 -0.017684  0.007955 -0.006607
2010-01-13  0.014106 -0.005741 -0.002145  0.009312
2010-01-14 -0.005792  0.004701  0.015972  0.020099
2010-01-15 -0.016712 -0.016699 -0.004006 -0.003230
2010-01-19  0.044238  0.013138  0.017909  0.007777
2010-01-20 -0.015392 -0.012270 -0.029000 -0.016399
2010-01-21 -0.017286  0.004428 -0.009597 -0.018960
2010-01-22 -0.049599 -0.056554 -0.027132 -0.034988
2010-01-25  0.026903 -0.018200  0.004940  0.012431
2010-01-26  0.014133  0.004481 -0.002934  0.006139
2010-01-27  0.009420 -0.000590  0.004612  0.005763
2010-01-28 -0.041322 -0.014407 -0.020423 -0.017189
2010-01-29 -0.036279 -0.008142 -0.010990 -0.033608
2010-02-01  0.013902  0.005812  0.018629  0.008162
2010-02-02  0.005803 -0.003565  0.006898  0.001760
2010-02-03  0.017206  0.018263  0.001036  0.005973
2010-02-04 -0.036039 -0.025961 -0.021168 -0.027593
2010-02-05  0.017756  0.008561  0.004228  0.006466
2010-02-08 -0.006856  0.004103 -0.008864 -0.010707
2010-02-09  0.010664  0.005567  0.010912  0.010462
2010-02-10 -0.005454 -0.003710 -0.003247 -0.000714
2010-02-11  0.018194  0.003649  0.007491  0.004645
2010-02-12  0.008607 -0.006115  0.002182 -0.006757
2010-02-16  0.015071  0.015344  0.009919  0.019784
...              ...       ...       ...       ...
2016-09-12  0.022399  0.012321  0.016700  0.014944
2016-09-13  0.023805 -0.012132 -0.015667 -0.009115
2016-09-14  0.035387  0.003686 -0.011296 -0.004776
2016-09-15  0.033998  0.012158  0.010451  0.016530
2016-09-16 -0.005624 -0.003732 -0.011692  0.001049
2016-09-19 -0.011660 -0.004136  0.006695 -0.005590
2016-09-20 -0.000088  0.007457 -0.002712 -0.002108
2016-09-21 -0.000176  0.006235  0.006993  0.016722
2016-09-22  0.009423  0.014158  0.003729  0.001039
2016-09-23 -0.016664 -0.000394 -0.007239 -0.006745
2016-09-26  0.001508 -0.016127 -0.006452 -0.009229
2016-09-27  0.001860  0.011366  0.018119  0.018453
2016-09-28  0.007605 -0.001852  0.009696  0.001380
2016-09-29 -0.015533 -0.008381 -0.001137 -0.010856
2016-09-30  0.007755  0.002942  0.004680  0.003484
2016-10-03 -0.004688 -0.006085 -0.007806 -0.003125
2016-10-04  0.004266  0.005009 -0.007296 -0.003135
2016-10-05  0.000443  0.000051  0.003963  0.006988
2016-10-06  0.007430  0.000502 -0.001273  0.001735
2016-10-07  0.001493 -0.002291 -0.007713  0.001039
2016-10-10  0.017447  0.014011  0.008672  0.004152
2016-10-11  0.002154 -0.003652 -0.014202 -0.014645
2016-10-12  0.008942  0.003920 -0.003230 -0.001399
2016-10-13 -0.003068 -0.010113 -0.003694 -0.003327
2016-10-14  0.005556  0.000437  0.004749  0.008784
2016-10-17 -0.000680  0.001837  0.002072 -0.003483
2016-10-18 -0.000681  0.019616 -0.026168  0.007690
2016-10-19 -0.002979  0.007846  0.003583 -0.002255
2016-10-20 -0.000512 -0.005652  0.001719 -0.004867
2016-10-21 -0.003930  0.003011 -0.012474  0.042096

[1714 rows x 4 columns]

In [61]:
returns.tail()

                AAPL      GOOG       IBM      MSFT
Date
2016-10-17 -0.000680  0.001837  0.002072 -0.003483
2016-10-18 -0.000681  0.019616 -0.026168  0.007690
2016-10-19 -0.002979  0.007846  0.003583 -0.002255
2016-10-20 -0.000512 -0.005652  0.001719 -0.004867
2016-10-21 -0.003930  0.003011 -0.012474  0.042096

returns['MSFT'].corr(returns['IBM'])

In [63]:
returns['MSFT'].cov(returns['IBM'])

8.870655479703546e-05

In [64]:
returns.MSFT.corr(returns.IBM)

0.4997636114415114

In [66]:
returns.corr()

          AAPL      GOOG       IBM      MSFT
AAPL  1.000000  0.407919  0.386817  0.389695
GOOG  0.407919  1.000000  0.405099  0.465919
IBM   0.386817  0.405099  1.000000  0.499764
MSFT  0.389695  0.465919  0.499764  1.000000

In [67]:
returns.cov()

          AAPL      GOOG       IBM      MSFT
AAPL  0.000277  0.000107  0.000078  0.000095
GOOG  0.000107  0.000251  0.000078  0.000108
IBM   0.000078  0.000078  0.000146  0.000089
MSFT  0.000095  0.000108  0.000089  0.000215

In [68]:
returns.corrwith(returns.IBM)

AAPL    0.386817
GOOG    0.405099
IBM     1.000000
MSFT    0.499764
dtype: float64

In [69]:
returns.corrwith(volume)

AAPL   -0.075565
GOOG   -0.007067
IBM    -0.204849
MSFT   -0.092950
dtype: float64

In [70]:
obj = pd.Series(['c', 'a', 'd', 'a', 'a', 'b', 'b', 'c', 'c'])

obj

0    c
1    a
2    d
3    a
4    a
5    b
6    b
7    c
8    c
dtype: object

In [71]:
uniques = obj.unique()

uniques

array(['c', 'a', 'd', 'b'], dtype=object)

In [72]:
obj.value_counts()

a    3
c    3
b    2
d    1
dtype: int64

pd.value_counts(obj.values, sort=False)

In [78]:
obj

0    c
1    a
2    d
3    a
4    a
5    b
6    b
7    c
8    c
dtype: object

In [85]:
mask = obj.isin(['b', 'c'])

mask

0     True
1    False
2    False
3    False
4    False
5     True
6     True
7     True
8     True
dtype: bool

In [86]:
obj[mask]

0    c
5    b
6    b
7    c
8    c
dtype: object

In [87]:
to_match = pd.Series(['c', 'a', 'b', 'b', 'c', 'a'])

unique_vals = pd.Series(['c', 'b', 'a'])

pd.Index(unique_vals).get_indexer(to_match)

array([0, 2, 1, 1, 0, 2])

In [88]:
data = pd.DataFrame({'Qu1': [1, 3, 4, 3, 4], 'Qu2': [2, 3, 1, 2, 3], 'Qu3': [1, 5, 2, 4, 4]})

data

   Qu1  Qu2  Qu3
0    1    2    1
1    3    3    5
2    4    1    2
3    3    2    4
4    4    3    4

In [90]:
result = data.apply(pd.value_counts).fillna(0)
result

   Qu1  Qu2  Qu3
1  1.0  1.0  1.0
2  0.0  2.0  1.0
3  2.0  2.0  0.0
4  2.0  0.0  2.0
5  0.0  0.0  1.0

In [ ]:
#end